```
tf apply -var-file=common.tfvars                                                                              
data.aws_iam_policy_document.flow_log: Reading...
data.aws_iam_policy_document.assume_role: Reading...
data.aws_iam_policy_document.flow_log: Read complete after 0s [id=3253318109]
data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2717921857]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.flow_log_group will be created
  + resource "aws_cloudwatch_log_group" "flow_log_group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/dev-infra-networking/vpc/flow-logs"
      + name_prefix       = (known after apply)
      + retention_in_days = 5
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-flow-log-group"
          + "Project"     = "infra-networking"
        }
      + tags_all          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-flow-log-group"
          + "Project"     = "infra-networking"
        }
    }

  # aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-eip-0"
          + "Project"     = "infra-networking"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-eip-0"
          + "Project"     = "infra-networking"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-eip-1"
          + "Project"     = "infra-networking"
        }
      + tags_all             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-eip-1"
          + "Project"     = "infra-networking"
        }
      + vpc                  = (known after apply)
    }

  # aws_flow_log.vpc_flow_log will be created
  + resource "aws_flow_log" "vpc_flow_log" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags                     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-flow-log"
          + "Project"     = "infra-networking"
        }
      + tags_all                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-flow-log"
          + "Project"     = "infra-networking"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # aws_iam_role.flow_log_role will be created
  + resource "aws_iam_role" "flow_log_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-infra-networking-flow-log-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-flow-log-role"
          + "Project"     = "infra-networking"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-flow-log-role"
          + "Project"     = "infra-networking"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy.flow_log_policy will be created
  + resource "aws_iam_role_policy" "flow_log_policy" {
      + id          = (known after apply)
      + name        = "dev-infra-networking-flow-log-policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-igw"
          + "Project"     = "infra-networking"
        }
      + tags_all = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-igw"
          + "Project"     = "infra-networking"
        }
      + vpc_id   = (known after apply)
    }

  # aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-nat-0"
          + "Project"     = "infra-networking"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-nat-0"
          + "Project"     = "infra-networking"
        }
    }

  # aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-nat-1"
          + "Project"     = "infra-networking"
        }
      + tags_all                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-nat-1"
          + "Project"     = "infra-networking"
        }
    }

  # aws_network_acl.private will be created
  + resource "aws_network_acl" "private" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "10.0.0.0/16"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-private-nacl"
          + "Project"     = "infra-networking"
        }
      + tags_all   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-private-nacl"
          + "Project"     = "infra-networking"
        }
      + vpc_id     = (known after apply)
    }

  # aws_network_acl.public will be created
  + resource "aws_network_acl" "public" {
      + arn        = (known after apply)
      + egress     = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + id         = (known after apply)
      + ingress    = [
          + {
              + action          = "allow"
              + cidr_block      = "0.0.0.0/0"
              + from_port       = 0
              + protocol        = "-1"
              + rule_no         = 100
              + to_port         = 0
                # (1 unchanged attribute hidden)
            },
        ]
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-public-nacl"
          + "Project"     = "infra-networking"
        }
      + tags_all   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-public-nacl"
          + "Project"     = "infra-networking"
        }
      + vpc_id     = (known after apply)
    }

  # aws_route.igw will be created
  + resource "aws_route" "igw" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.nat[0] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route.nat[1] will be created
  + resource "aws_route" "nat" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
    }

  # aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-private-rt-0"
          + "Project"     = "infra-networking"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-private-rt-0"
          + "Project"     = "infra-networking"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-private-rt-1"
          + "Project"     = "infra-networking"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-private-rt-1"
          + "Project"     = "infra-networking"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-public-rt"
          + "Project"     = "infra-networking"
        }
      + tags_all         = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-public-rt"
          + "Project"     = "infra-networking"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.vpc_endpoints will be created
  + resource "aws_security_group" "vpc_endpoints" {
      + arn                    = (known after apply)
      + description            = "Security group for VPC Endpoints"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "HTTPS from VPC"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "dev-infra-networking-vpc-endpoints-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-vpc-endpoints-sg"
          + "Project"     = "infra-networking"
        }
      + tags_all               = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-vpc-endpoints-sg"
          + "Project"     = "infra-networking"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.11.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-private-0"
          + "Project"     = "infra-networking"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-private-0"
          + "Project"     = "infra-networking"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.12.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-private-1"
          + "Project"     = "infra-networking"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-private-1"
          + "Project"     = "infra-networking"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-public-0"
          + "Project"     = "infra-networking"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-public-0"
          + "Project"     = "infra-networking"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-public-1"
          + "Project"     = "infra-networking"
        }
      + tags_all                                       = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-public-1"
          + "Project"     = "infra-networking"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-vpc"
          + "Project"     = "infra-networking"
        }
      + tags_all                             = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-vpc"
          + "Project"     = "infra-networking"
        }
    }

  # aws_vpc_endpoint.dynamodb will be created
  + resource "aws_vpc_endpoint" "dynamodb" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = (known after apply)
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.dynamodb"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-dynamodb-endpoint"
          + "Project"     = "infra-networking"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-dynamodb-endpoint"
          + "Project"     = "infra-networking"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.ecr_api will be created
  + resource "aws_vpc_endpoint" "ecr_api" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.ecr.api"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-ecr-api-endpoint"
          + "Project"     = "infra-networking"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-ecr-api-endpoint"
          + "Project"     = "infra-networking"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.ecr_dkr will be created
  + resource "aws_vpc_endpoint" "ecr_dkr" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.ecr.dkr"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-ecr-dkr-endpoint"
          + "Project"     = "infra-networking"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-ecr-dkr-endpoint"
          + "Project"     = "infra-networking"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.logs will be created
  + resource "aws_vpc_endpoint" "logs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.logs"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-logs-endpoint"
          + "Project"     = "infra-networking"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-logs-endpoint"
          + "Project"     = "infra-networking"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = (known after apply)
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-northeast-1.s3"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-s3-endpoint"
          + "Project"     = "infra-networking"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "dev-infra-networking-s3-endpoint"
          + "Project"     = "infra-networking"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

Plan: 32 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + internet_gateway_id      = (known after apply)
  + nat_gateway_ids          = [
      + (known after apply),
      + (known after apply),
    ]
  + nat_gateway_public_ips   = [
      + (known after apply),
      + (known after apply),
    ]
  + private_subnet_ids       = [
      + (known after apply),
      + (known after apply),
    ]
  + public_subnet_ids        = [
      + (known after apply),
      + (known after apply),
    ]
  + vpc_cidr                 = "10.0.0.0/16"
  + vpc_endpoint_dynamodb_id = (known after apply)
  + vpc_endpoint_ecr_api_id  = (known after apply)
  + vpc_endpoint_ecr_dkr_id  = (known after apply)
  + vpc_endpoint_logs_id     = (known after apply)
  + vpc_endpoint_s3_id       = (known after apply)
  + vpc_id                   = (known after apply)

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_eip.nat[0]: Creating...
aws_vpc.this: Creating...
aws_iam_role.flow_log_role: Creating...
aws_eip.nat[1]: Creating...
aws_cloudwatch_log_group.flow_log_group: Creating...
aws_cloudwatch_log_group.flow_log_group: Creation complete after 0s [id=/aws/dev-infra-networking/vpc/flow-logs]
aws_eip.nat[0]: Creation complete after 1s [id=eipalloc-022e11da47fe4f7eb]
aws_eip.nat[1]: Creation complete after 1s [id=eipalloc-01af12489cace2f00]
aws_iam_role.flow_log_role: Creation complete after 2s [id=dev-infra-networking-flow-log-role]
aws_iam_role_policy.flow_log_policy: Creating...
aws_iam_role_policy.flow_log_policy: Creation complete after 0s [id=dev-infra-networking-flow-log-role:dev-infra-networking-flow-log-policy]
aws_vpc.this: Still creating... [00m10s elapsed]
aws_vpc.this: Creation complete after 12s [id=vpc-047b6cadf8de9b049]
aws_internet_gateway.this: Creating...
aws_route_table.public: Creating...
aws_route_table.private[1]: Creating...
aws_subnet.public[1]: Creating...
aws_route_table.private[0]: Creating...
aws_subnet.private[0]: Creating...
aws_flow_log.vpc_flow_log: Creating...
aws_subnet.public[0]: Creating...
aws_subnet.private[1]: Creating...
aws_security_group.vpc_endpoints: Creating...
aws_flow_log.vpc_flow_log: Creation complete after 0s [id=fl-0bb3146081c01833c]
aws_internet_gateway.this: Creation complete after 0s [id=igw-04c718e7a1b2d863e]
aws_route_table.private[1]: Creation complete after 0s [id=rtb-09d7d770cc5144e66]
aws_route_table.private[0]: Creation complete after 0s [id=rtb-05ae3d346447c8775]
aws_route_table.public: Creation complete after 0s [id=rtb-09ab4d7ed6a0f12c6]
aws_route.igw: Creating...
aws_vpc_endpoint.s3: Creating...
aws_vpc_endpoint.dynamodb: Creating...
aws_subnet.private[0]: Creation complete after 0s [id=subnet-05c5bb0141ba3847e]
aws_route.igw: Creation complete after 1s [id=r-rtb-09ab4d7ed6a0f12c61080289494]
aws_subnet.private[1]: Creation complete after 2s [id=subnet-08db230d39b3049ed]
aws_route_table_association.private[1]: Creating...
aws_route_table_association.private[0]: Creating...
aws_network_acl.private: Creating...
aws_security_group.vpc_endpoints: Creation complete after 2s [id=sg-0d47044a1c7431098]
aws_vpc_endpoint.ecr_api: Creating...
aws_vpc_endpoint.ecr_dkr: Creating...
aws_vpc_endpoint.logs: Creating...
aws_route_table_association.private[1]: Creation complete after 1s [id=rtbassoc-0eb2572559f178109]
aws_route_table_association.private[0]: Creation complete after 1s [id=rtbassoc-0d78408838468fada]
aws_network_acl.private: Creation complete after 2s [id=acl-0c6d8adafd86e6270]
aws_vpc_endpoint.dynamodb: Creation complete after 6s [id=vpce-0a452e866abce5f16]
aws_vpc_endpoint.s3: Creation complete after 6s [id=vpce-04960e8834d3edbe8]
aws_subnet.public[0]: Still creating... [00m10s elapsed]
aws_subnet.public[1]: Still creating... [00m10s elapsed]
aws_subnet.public[1]: Creation complete after 11s [id=subnet-0bb0e6993a96be749]
aws_subnet.public[0]: Creation complete after 11s [id=subnet-087cf355806f39fbe]
aws_route_table_association.public[1]: Creating...
aws_network_acl.public: Creating...
aws_route_table_association.public[0]: Creating...
aws_nat_gateway.this[0]: Creating...
aws_nat_gateway.this[1]: Creating...
aws_route_table_association.public[0]: Creation complete after 1s [id=rtbassoc-0cec28a581bbcbdcf]
aws_route_table_association.public[1]: Creation complete after 1s [id=rtbassoc-0226ffc9e5a8e83c6]
aws_vpc_endpoint.ecr_api: Still creating... [00m10s elapsed]
aws_vpc_endpoint.ecr_dkr: Still creating... [00m10s elapsed]
aws_vpc_endpoint.logs: Still creating... [00m10s elapsed]
aws_network_acl.public: Creation complete after 2s [id=acl-0f0e0f4d757b0e507]
aws_nat_gateway.this[0]: Still creating... [00m10s elapsed]
aws_nat_gateway.this[1]: Still creating... [00m10s elapsed]
aws_vpc_endpoint.ecr_api: Still creating... [00m20s elapsed]
aws_vpc_endpoint.ecr_dkr: Still creating... [00m20s elapsed]
aws_vpc_endpoint.logs: Still creating... [00m20s elapsed]
aws_nat_gateway.this[1]: Still creating... [00m20s elapsed]
aws_nat_gateway.this[0]: Still creating... [00m20s elapsed]
aws_vpc_endpoint.ecr_api: Still creating... [00m30s elapsed]
aws_vpc_endpoint.ecr_dkr: Still creating... [00m30s elapsed]
aws_vpc_endpoint.logs: Still creating... [00m30s elapsed]
aws_nat_gateway.this[0]: Still creating... [00m30s elapsed]
aws_nat_gateway.this[1]: Still creating... [00m30s elapsed]
aws_vpc_endpoint.ecr_api: Still creating... [00m40s elapsed]
aws_vpc_endpoint.ecr_dkr: Still creating... [00m40s elapsed]
aws_vpc_endpoint.logs: Still creating... [00m40s elapsed]
aws_nat_gateway.this[1]: Still creating... [00m40s elapsed]
aws_nat_gateway.this[0]: Still creating... [00m40s elapsed]
aws_vpc_endpoint.ecr_api: Still creating... [00m50s elapsed]
aws_vpc_endpoint.ecr_dkr: Still creating... [00m50s elapsed]
aws_vpc_endpoint.logs: Still creating... [00m50s elapsed]
aws_nat_gateway.this[0]: Still creating... [00m50s elapsed]
aws_nat_gateway.this[1]: Still creating... [00m50s elapsed]
aws_vpc_endpoint.logs: Still creating... [01m00s elapsed]
aws_vpc_endpoint.ecr_api: Still creating... [01m00s elapsed]
aws_vpc_endpoint.ecr_dkr: Still creating... [01m00s elapsed]
aws_nat_gateway.this[0]: Still creating... [01m00s elapsed]
aws_nat_gateway.this[1]: Still creating... [01m00s elapsed]
aws_vpc_endpoint.ecr_dkr: Still creating... [01m11s elapsed]
aws_vpc_endpoint.ecr_api: Still creating... [01m11s elapsed]
aws_vpc_endpoint.logs: Still creating... [01m11s elapsed]
aws_nat_gateway.this[1]: Still creating... [01m10s elapsed]
aws_nat_gateway.this[0]: Still creating... [01m10s elapsed]
aws_vpc_endpoint.logs: Still creating... [01m21s elapsed]
aws_vpc_endpoint.ecr_api: Still creating... [01m21s elapsed]
aws_vpc_endpoint.ecr_dkr: Still creating... [01m21s elapsed]
aws_nat_gateway.this[0]: Still creating... [01m20s elapsed]
aws_nat_gateway.this[1]: Still creating... [01m20s elapsed]
aws_vpc_endpoint.ecr_dkr: Still creating... [01m31s elapsed]
aws_vpc_endpoint.ecr_api: Still creating... [01m31s elapsed]
aws_vpc_endpoint.logs: Still creating... [01m31s elapsed]
aws_vpc_endpoint.ecr_dkr: Creation complete after 1m33s [id=vpce-03834226103d9f59a]
aws_nat_gateway.this[1]: Creation complete after 1m25s [id=nat-0792f4262403b5100]
aws_vpc_endpoint.logs: Creation complete after 1m34s [id=vpce-0c46cda157de02341]
aws_nat_gateway.this[0]: Still creating... [01m30s elapsed]
aws_vpc_endpoint.ecr_api: Still creating... [01m41s elapsed]
aws_nat_gateway.this[0]: Still creating... [01m40s elapsed]
aws_vpc_endpoint.ecr_api: Still creating... [01m51s elapsed]
aws_vpc_endpoint.ecr_api: Creation complete after 1m53s [id=vpce-0103b7035cd937870]
aws_nat_gateway.this[0]: Still creating... [01m50s elapsed]
aws_nat_gateway.this[0]: Creation complete after 1m55s [id=nat-0f98999b3ce0d6c38]
aws_route.nat[0]: Creating...
aws_route.nat[1]: Creating...
aws_route.nat[1]: Creation complete after 1s [id=r-rtb-09d7d770cc5144e661080289494]
aws_route.nat[0]: Creation complete after 1s [id=r-rtb-05ae3d346447c87751080289494]

Apply complete! Resources: 32 added, 0 changed, 0 destroyed.

Outputs:

internet_gateway_id = "igw-04c718e7a1b2d863e"
nat_gateway_ids = [
  "nat-0f98999b3ce0d6c38",
  "nat-0792f4262403b5100",
]
nat_gateway_public_ips = [
  "18.176.202.11",
  "54.199.166.70",
]
private_subnet_ids = [
  "subnet-05c5bb0141ba3847e",
  "subnet-08db230d39b3049ed",
]
public_subnet_ids = [
  "subnet-087cf355806f39fbe",
  "subnet-0bb0e6993a96be749",
]
vpc_cidr = "10.0.0.0/16"
vpc_endpoint_dynamodb_id = "vpce-0a452e866abce5f16"
vpc_endpoint_ecr_api_id = "vpce-0103b7035cd937870"
vpc_endpoint_ecr_dkr_id = "vpce-03834226103d9f59a"
vpc_endpoint_logs_id = "vpce-0c46cda157de02341"
vpc_endpoint_s3_id = "vpce-04960e8834d3edbe8"
vpc_id = "vpc-047b6cadf8de9b049"
```